# BRepBuilderGeometryId Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BRepBuilderGeometryId Class
Members See Also
---
This class is used by the BRepBuilder class to identify objects it creates (faces, edges, etc.).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class BRepBuilderGeometryId : IDisposable
```

Visual Basic
---
```text
Public Class BRepBuilderGeometryId _
	Implements IDisposable
```

Visual C++
---
```text
public ref class BRepBuilderGeometryId : IDisposable
```

# Remarks
The user should use these ids to organize the calls to BRepBuilder methods (e.g., addLoop() takes a face id as input, referring to a face that was previously added by a call to AddFace()). The ids are only valid while the BRepBuilder is in use.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BRepBuilderGeometryId
# See Also
BRepBuilderGeometryId Members
Autodesk.Revit.DB Namespace